yade-dev/examples/openfoam/example_pimpleFoamYade/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    y1
    {
        type            wall;
        inGroups        1(wall);
        nFaces          400;
        startFace       22800;
    }
    y0
    {
        type            wall;
        inGroups        1(wall);
        nFaces          400;
        startFace       23200;
    }
    x0
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          400;
        startFace       23600;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  x1;
    }
    x1
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          400;
        startFace       24000;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  x0;
    }
    z0
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          400;
        startFace       24400;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  z1;
    }
    z1
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          400;
        startFace       24800;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  z0;
    }
)

// ************************************************************************* //
