yade-dev/examples/openfoam/example_pimpleFoamYade/constant/transportProperties

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

continuousPhaseName fluid;

rho.fluid         1000; 
partDensity       1000; 


transportModel  Newtonian;
nu              1e-06;

// ************************************************************************* //
